xioTechnologies/x-IMU3-Software-Test/x-IMU3-GUI/ds30 Custom Loader/firmware_sd_PIC32MZ2048EFG124/src/framework/peripheral/osc/processor/osc_p32mz2048ech100_ds30.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _OSC_P32MZ2048ECH100_H
#define _OSC_P32MZ2048ECH100_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit_ds30.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    OSC_ID_0 = 0,
    OSC_NUMBER_OF_MODULES = 1

} OSC_MODULE_ID;

typedef enum {

    OSC_ON_WAIT_IDLE = 0x00,
    OSC_ON_WAIT_SLEEP = 0x01

} OSC_OPERATION_ON_WAIT;

typedef enum {

    OSC_FRC_DIV_256 = 0x07,
    OSC_FRC_DIV_64 = 0x06,
    OSC_FRC_DIV_32 = 0x05,
    OSC_FRC_DIV_16 = 0x04,
    OSC_FRC_DIV_8 = 0x03,
    OSC_FRC_DIV_4 = 0x02,
    OSC_FRC_DIV_2 = 0x01,
    OSC_FRC_DIV_1 = 0x00

} OSC_FRC_DIV;

typedef enum {

    OSC_FRC_WITH_PLL = 0x01,
    OSC_PRIMARY = 0x02,
    OSC_PRIMARY_WITH_PLL = 0x03,
    OSC_SECONDARY = 0x04,
    OSC_LPRC = 0x05,
    OSC_BFRC = 0x06,
    OSC_FRC_BY_FRCDIV = 0x00

} OSC_SYS_TYPE;

typedef enum {

    OSC_REF_BASECLOCK_SYSCLK = 0x00,
    OSC_REF_BASECLOCK_PBCLK = 0x01,
    OSC_REF_BASECLOCK_PRIMARY = 0x02,
    OSC_REF_BASECLOCK_FRC = 0x03,
    OSC_REF_BASECLOCK_LPRC = 0x04,
    OSC_REF_BASECLOCK_SOSC = 0x05,
    OSC_REF_BASECLOCK_SYSPLLOUT = 0x07,
    OSC_REF_BASECLOCK_EXT = 0x08,
    OSC_REF_BASECLOCK_BFRC = 0x09

} OSC_REF_BASECLOCK;

typedef enum {

    OSC_USBCLOCK_SOURCE_NONE

} OSC_USBCLOCK_SOURCE;

typedef enum {

    OSC_SYSPLL_OUT_DIV_32 = 0x05,
    OSC_SYSPLL_OUT_DIV_16 = 0x04,
    OSC_SYSPLL_OUT_DIV_8 = 0x03,
    OSC_SYSPLL_OUT_DIV_4 = 0x02,
    OSC_SYSPLL_OUT_DIV_2 = 0x01

} OSC_SYSPLL_OUT_DIV;

typedef enum {

    OSC_UPLL_OUT_DIV_NONE

} OSC_UPLL_OUT_DIV;

typedef enum {

    OSC_BTPLL_OUT_DIV_NONE

} OSC_BTPLL_OUT_DIV;

typedef enum {

    OSC_PLL_SYSTEM = 0x00,
    OSC_PLL_USB = 0x01

} OSC_PLL_SELECT;

typedef enum {

    OSC_PERIPHERAL_BUS_1 = 0x00,
    OSC_PERIPHERAL_BUS_2 = 0x01,
    OSC_PERIPHERAL_BUS_3 = 0x02,
    OSC_PERIPHERAL_BUS_4 = 0x03,
    OSC_PERIPHERAL_BUS_5 = 0x04,
    OSC_PERIPHERAL_BUS_7 = 0x06,
    OSC_PERIPHERAL_BUS_8 = 0x07

} OSC_PERIPHERAL_BUS;

typedef enum {

    OSC_REFERENCE_1 = 0x00,
    OSC_REFERENCE_2 = 0x01,
    OSC_REFERENCE_3 = 0x02,
    OSC_REFERENCE_4 = 0x03

} OSC_REFERENCE;

typedef enum {

    OSC_SYSPLL_IN_DIV_8 = 0x07,
    OSC_SYSPLL_IN_DIV_7 = 0x06,
    OSC_SYSPLL_IN_DIV_6 = 0x05,
    OSC_SYSPLL_IN_DIV_5 = 0x04,
    OSC_SYSPLL_IN_DIV_4 = 0x03,
    OSC_SYSPLL_IN_DIV_3 = 0x02,
    OSC_SYSPLL_IN_DIV_2 = 0x01,
    OSC_SYSPLL_IN_DIV_1 = 0x00

} OSC_SYSPLL_IN_DIV;

typedef enum {

    OSC_UPLL_IN_DIV_NONE

} OSC_UPLL_IN_DIV;

typedef enum {

    OSC_BTPLL_IN_DIV_NONE

} OSC_BTPLL_IN_DIV;

typedef enum {

    OSC_SYSPLL_FREQ_RANGE_34M_TO_68M = 0x05,
    OSC_SYSPLL_FREQ_RANGE_21M_TO_42M = 0x04,
    OSC_SYSPLL_FREQ_RANGE_13M_TO_26M = 0x03,
    OSC_SYSPLL_FREQ_RANGE_8M_TO_16M = 0x02,
    OSC_SYSPLL_FREQ_RANGE_5M_TO_10M = 0x01,
    OSC_SYSPLL_FREQ_RANGE_BYPASS = 0x00

} OSC_SYSPLL_FREQ_RANGE;

typedef enum {

    OSC_SYSPLL_IN_CLK_SOURCE_FRC = 0x1,
    OSC_SYSPLL_IN_CLK_SOURCE_PRIMARY = 0x0

} OSC_SYSPLL_IN_CLK_SOURCE;

typedef enum {

    OSC_UPLL_FREQ_RANGE_NONE

} OSC_UPLL_FREQ_RANGE;

typedef enum {

    OSC_BTPLL_FREQ_RANGE_NONE

} OSC_BTPLL_FREQ_RANGE;

typedef enum {

    OSC_BTPLL_IN_CLK_SOURCE_NONE

} OSC_BTPLL_IN_CLK_SOURCE;

typedef enum {

    OSC_SLEEP_TO_STARTUP_CLK_TYPE_NONE

} OSC_SLEEP_TO_STARTUP_CLK_TYPE;

typedef enum {

    OSC_CLOCK_ID_NONE

} OSC_CLOCK_ID;

typedef enum {

    OSC_CLOCK_DIAG_NONE

} OSC_CLOCK_DIAG;

typedef enum {

    OSC_CLOCK_SLEW_TYPE_NONE

} OSC_CLOCK_SLEW_TYPE;

/* Section 2 - Feature variant inclusion */

#define PLIB_TEMPLATE PLIB_INLINE
#include "../templates/osc_OnWaitAction_Default_ds30.h"
#include "../templates/osc_SecondaryEnable_Default_ds30.h"
#include "../templates/osc_SecondaryReady_Default_ds30.h"
#include "../templates/osc_FRCDivisor_Default_ds30.h"
#include "../templates/osc_OscSelect_Mz_ds30.h"
#include "../templates/osc_OscSwitchInit_Default_ds30.h"
#include "../templates/osc_OscCurrentGet_PIC32_1_ds30.h"
#include "../templates/osc_PBClockDivisor_PIC32_2_ds30.h"
#include "../templates/osc_PBClockReady_PIC32_1_ds30.h"
#include "../templates/osc_UsbClockSource_Unsupported_ds30.h"
#include "../templates/osc_PLLLockStatus_Default_ds30.h"
#include "../templates/osc_PLLClockLock_Default_ds30.h"
#include "../templates/osc_PLLMultiplier_PIC32_2_ds30.h"
#include "../templates/osc_UPLLMultiplier_Unsupported_ds30.h"
#include "../templates/osc_BTPLLMultiplier_Unsupported_ds30.h"
#include "../templates/osc_PLLOutputDivisor_PIC32_2_ds30.h"
#include "../templates/osc_UPLLOutputDivisor_Unsupported_ds30.h"
#include "../templates/osc_BTPLLOutputDivisor_Unsupported_ds30.h"
#include "../templates/osc_ClockFail_Default_ds30.h"
#include "../templates/osc_FRCTuning_Default_ds30.h"
#include "../templates/osc_ReferenceOscBaseClock_PIC32_2_ds30.h"
#include "../templates/osc_ReferenceOscChange_PIC32_2_ds30.h"
#include "../templates/osc_ReferenceOscChangeActive_PIC32_2_ds30.h"
#include "../templates/osc_ReferenceOscStopInSleep_PIC32_2_ds30.h"
#include "../templates/osc_ReferenceOutputEnable_PIC32_2_ds30.h"
#include "../templates/osc_ReferenceOscStopInIdleEnable_PIC32_2_ds30.h"
#include "../templates/osc_ReferenceOscEnable_PIC32_2_ds30.h"
#include "../templates/osc_ReferenceOscDivisor_PIC32_2_ds30.h"
#include "../templates/osc_ReferenceOscTrim_PIC32_2_ds30.h"
#include "../templates/osc_PBClockOutputEnable_Default_ds30.h"
#include "../templates/osc_PLLInputDivisor_Default_ds30.h"
#include "../templates/osc_UPLLInputDivisor_Unsupported_ds30.h"
#include "../templates/osc_BTPLLInputDivisor_Unsupported_ds30.h"
#include "../templates/osc_PLLInputClockSource_Default_ds30.h"
#include "../templates/osc_BTPLLInputClockSource_Unsupported_ds30.h"
#include "../templates/osc_PLLFrequencyRange_Default_ds30.h"
#include "../templates/osc_BTPLLFrequencyRange_Unsupported_ds30.h"
#include "../templates/osc_UPLLFrequencyRange_Unsupported_ds30.h"
#include "../templates/osc_SleepToStartupClock_Unsupported_ds30.h"
#include "../templates/osc_ClockReadyStatus_Unsupported_ds30.h"
#include "../templates/osc_ClockDiagStatus_Unsupported_ds30.h"
#include "../templates/osc_ClockSlewingStatus_Unsupported_ds30.h"
#include "../templates/osc_SlewEnableControl_Unsupported_ds30.h"
#include "../templates/osc_SlewDivisorStepControl_Unsupported_ds30.h"
#include "../templates/osc_SystemClockDivisorControl_Unsupported_ds30.h"
#include "../templates/osc_DreamModeControl_Unsupported_ds30.h"
#include "../templates/osc_ForceLock_Unsupported_ds30.h"
#include "../templates/osc_ResetPLL_Unsupported_ds30.h"
#include "../templates/osc_PLLBypass_Unsupported_ds30.h"
#include "../templates/osc_BTPLLClockOut_Unsupported_ds30.h"

